app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      if params[:sort_using]
        session[:sort_using] = params[:sort_using]
        sort_criteria = params[:sort_using]
      elsif session[:sort_using]
        sort_criteria = session[:sort_using]
      end

      @all_ratings = Movie.all_ratings

      if(params[:ratings].nil?)
        if(session[:ratings_display].nil?)
          ratings = @all_ratings
        else
          ratings = JSON.parse(session[:ratings_display])
        end
      else
        ratings = params[:ratings].keys
      end

      @ratings_display = ratings

      if sort_criteria == "title"
        @movies = Movie.with_ratings(ratings).order(:title)
      elsif sort_criteria == "release_date"
        @movies = Movie.with_ratings(ratings).order(:release_date)
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC

    def create
      @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Adharvan"], ["rating", "PG-13"], ["release_date", "2021-09-30 00:00:00.000000"], ["created_at", "2021-09-30 17:45:17.721444"], ["updated_at", "2021-09-30 17:45:17.721444"]]